DanielR92/CMT2300A/RP2040/main.cpp
#define CMT2300A_MASK_TX_DONE_FLG       0x08
#define CMT2300A_MASK_PKT_OK_FLG        0x01

#define CRC8_INIT                       0x00
#define CRC8_POLY                       0x01

#define CRC16_MODBUS_POLYNOM            0xA001

#define U32_B3(val) ((uint8_t)((val >> 24) & 0xff))
#define U32_B2(val) ((uint8_t)((val >> 16) & 0xff))
#define U32_B1(val) ((uint8_t)((val >>  8) & 0xff))
#define U32_B0(val) ((uint8_t)((val      ) & 0xff))

#ifdef RP2040
    typedef RP2040Spi3w SpiType;
#else
    typedef SoftSpi3w<DEF_CS_PIN, DEF_FCS_PIN, DEF_SCK_PIN, DEF_SDIO_PIN> SpiType;
#endif

SpiType spi3w;
uint32_t cnt;

uint8_t mLastFreq;
uint8_t mStartFreq;
uint8_t mEndFreq;
bool mFound;
uint32_t mPrevMillis;

uint8_t mRec[10][32];
uint8_t mRecId;
int8_t mRssi[10];
uint32_t mRxtime[10];
bool mRxFrag[10];
uint8_t mRetransmits;
uint8_t mLastRecId;

// config
uint32_t ts  = 1676804048; // timestamp
uint32_t dtu = 0x81001765; // 0x83266790; //
uint32_t wr  = 0x80423810;
// end config

void rxLoop(void);

uint8_t getChipStatus(void) {
    return spi3w.readReg(CMT2300A_CUS_MODE_STA) & CMT2300A_MASK_CHIP_MODE_STA;
}

//-----------------------------------------------------------------------------
uint8_t crc8(uint8_t buf[], uint8_t len) {
    uint8_t crc = CRC8_INIT;
    for(uint8_t i = 0; i < len; i++) {
        crc ^= buf[i];
        for(uint8_t b = 0; b < 8; b ++) {
            crc = (crc << 1) ^ ((crc & 0x80) ? CRC8_POLY : 0x00);
        }
    }
    return crc;
}

//-----------------------------------------------------------------------------
uint16_t crc16(uint8_t buf[], uint8_t len, uint16_t start) {
    uint16_t crc = start;
    uint8_t shift = 0;

    for(uint8_t i = 0; i < len; i ++) {
        crc = crc ^ buf[i];
        for(uint8_t bit = 0; bit < 8; bit ++) {
            shift = (crc & 0x0001);
            crc = crc >> 1;
            if(shift != 0)
                crc = crc ^ CRC16_MODBUS_POLYNOM;
        }
    }
    return crc;
}

//-----------------------------------------------------------------------------
void dumpBuf(const char* des, uint8_t buf[], uint8_t len, bool newline = true) {
    //Serial.println("------------------");
    Serial.print(String(des));
    for(uint8_t i = 0; i < len; i++) {
        if((0 != i) && (i % 32 == 0))
            Serial.println("");
        if(buf[i] < 16)
            Serial.print(" 0" + String(buf[i], HEX));
        else
            Serial.print(" " + String(buf[i], HEX));
    }
    if(newline)
        Serial.println("");
}

//-----------------------------------------------------------------------------
bool cmtSwitchStatus(uint8_t cmd, uint8_t waitFor, uint16_t cycles = 50000) {
    spi3w.writeReg(CMT2300A_CUS_MODE_CTL, cmd);
    while(cycles--) {
        delayMicroseconds(10);
        if(waitFor == (getChipStatus() & waitFor))
            return true;
    }
    Serial.println("status wait for: " + String(waitFor, HEX) + " read: " + String(getChipStatus(), HEX));
    return false;
}

//-----------------------------------------------------------------------------
void freqSetting(uint8_t setting, bool send7A = true) {
    spi3w.writeReg(0x18, 0x42);
    spi3w.writeReg(0x19, 0x6D);
    spi3w.writeReg(0x1A, 0x80);
    spi3w.writeReg(0x1B, 0x86);
    spi3w.writeReg(0x1C, 0x42);
    spi3w.writeReg(0x1D, 0x62);
    spi3w.writeReg(0x1E, 0x27);
    spi3w.writeReg(0x1F, 0x16);

    /*if(0 == setting) { // 871MHz
        spi3w.writeReg(0x18, 0x42);
        spi3w.writeReg(0x19, 0xA9);
        spi3w.writeReg(0x1A, 0xA4);
        spi3w.writeReg(0x1B, 0x8C);
        spi3w.writeReg(0x1C, 0x42);
        spi3w.writeReg(0x1D, 0x9E);
        spi3w.writeReg(0x1E, 0x4B);
        spi3w.writeReg(0x1F, 0x1C);
    } else if(1 == setting) { // 872MHz
        spi3w.writeReg(0x18, 0x42);
        spi3w.writeReg(0x19, 0x0b);
        spi3w.writeReg(0x1A, 0xcc);
        spi3w.writeReg(0x1B, 0x82);
        spi3w.writeReg(0x1C, 0x42);
        spi3w.writeReg(0x1D, 0x00);
        spi3w.writeReg(0x1E, 0x73);
        spi3w.writeReg(0x1F, 0x12);
    }*/
    if(send7A)
        spi3w.writeReg(0x27, 0x0A);
}

//-----------------------------------------------------------------------------
void switchFreq(void) {
    if(++mLastFreq > mEndFreq)
        mLastFreq = mStartFreq;

    //mLastFreq = 0x00;

    // 0: 868.00MHz
    // 1: 868.23MHz
    // 2: 868.46MHz
    // 3: 868.72MHz
    // 4: 868.97MHz
    spi3w.writeReg(CMT2300A_CUS_FREQ_CHNL, mLastFreq);
}

//-----------------------------------------------------------------------------
int8_t checkRx() {
    int8_t rssi = -128;
    /*if(CMT2300A_INT_SEL_TX_DONE != spi3w.readReg(CMT2300A_CUS_INT1_CTL))
        spi3w.writeReg(CMT2300A_CUS_INT1_CTL, CMT2300A_INT_SEL_TX_DONE);*/
    spi3w.readReg(CMT2300A_CUS_INT1_CTL);
    spi3w.writeReg(CMT2300A_CUS_INT1_CTL, CMT2300A_INT_SEL_TX_DONE);

        //if(0x00 == (spi3w.readReg(CMT2300A_CUS_INT_FLAG) & 0x0f))
        //spi3w.readReg(CMT2300A_CUS_INT_FLAG);
        {
            // no data received
            uint8_t tmp = spi3w.readReg(CMT2300A_CUS_INT_CLR1);
            if(0x08 == tmp) // first time after TX this reg is 0x08
                spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x04);
            else
                spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x00);

            if(0x10 == tmp)
                spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x10);
            else
                spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x00);

            spi3w.readReg(CMT2300A_CUS_FIFO_CTL); // necessary? -> if 0x02 last was read
                                                  //                  0x07 last was write
            spi3w.writeReg(CMT2300A_CUS_FIFO_CTL, 0x02);

            spi3w.writeReg(CMT2300A_CUS_FIFO_CLR, 0x02);
            spi3w.writeReg(0x16, 0x0C); // [4:3]: RSSI_DET_SEL, [2:0]: RSSI_AVG_MODE

            switchFreq();

            if(!cmtSwitchStatus(CMT2300A_GO_RX, CMT2300A_STA_RX))
                Serial.println("warn: cant reach RX mode!");
        }

        uint8_t state = 0x00;
            uint16_t timeout = 5000;
        for(uint8_t i = 0; i < 52; i++) {
            state = spi3w.readReg(CMT2300A_CUS_INT_FLAG);
            if(0x00 != state)
                break;
        }

