DanielR92/CMT2300A/RP2040/main.cpp
        #ifdef RP2040
        if((state & 0x10) == 0x10) {
            while(0 == gpio_get(CMT_GPIO3)) {
                usleep(10);
                if(0 == --timeout) {
                    //Serial.println("GPIO timeout");
                    break;
                }
            }
            if(0 != timeout) {
                uint16_t timeout2 = 5000;
                while(0x18 != (state & 0x18)) {
                    state = spi3w.readReg(CMT2300A_CUS_INT_FLAG);
                    if(0 == timeout2--) {
                        //Serial.println("state timeout");
                        break;
                    }
                }
            }
        }
        #endif


        if(0 != gpio_get(CMT_GPIO3)) {
            uint32_t loops = 0;
            while((state & 0x1b) != 0x1b) {
                state = spi3w.readReg(CMT2300A_CUS_INT_FLAG);

                //if(state == 0x18)
                //    delay(23);

                if((state & 0x20) == 0x20) {
                    Serial.println("receive PKT ERROR");
                    break;
                }
                else if((state & 0x40) == 0x40) {
                    Serial.println("receive COL ERROR");
                    break;
                }

                if(++loops > 5000) {
                    //Serial.println("receive error, loops, state: " + String(state, HEX));
                    break;
                }
            }
        }


        // receive ok (pream, sync, node, crc)
        //uint8_t buf[28] = {0};
        if((state & 0x1b) == 0x1b) {
            if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
                Serial.println("warn: not switched to standby mode!");

            if(mRecId < 10) {
                mRxtime[mRecId] = millis() - mRxtime[mRecId];
                spi3w.readFifo(mRec[mRecId], 28);
                mRssi[mRecId] = spi3w.readReg(CMT2300A_CUS_RSSI_DBM) - 128;
                mRxFrag[(mRec[mRecId][10] & 0x7f) - 1] = true;
                mRecId++;
            }


            if(!cmtSwitchStatus(CMT2300A_GO_SLEEP, CMT2300A_STA_SLEEP))
                Serial.println("warn: not switched to sleep mode!");
        }

        /*if(0 != timeout)
            Serial.println("RX DONE!!! RSSI: " + String(rssi) + " remain cnt: " + String(timeout));
*/
        if((state & 0x1b) == 0x1b) {
            //Serial.println("mLastFreq: " + String(mLastFreq, HEX));
            //dumpBuf("RX", &buf[1], 27, false);

            //Serial.print(", RSSI: " + String(rssi));

            /*uint8_t len = buf[0] + 1;
            buf[len-0] = 0x00;
            if(buf[0] == 0x1b) {
                buf[len-2] = 0x00;
                buf[len-1] = 0x00;
                uint16_t crc2 = crc16(&buf[11], len-13, 0xffff);
                Serial.print(", crc16: " + String(crc2, HEX));
                buf[len-3] = (crc2 >> 8 & 0xff);
                buf[len-2] = (crc2      & 0xff);
            }
            Serial.println(", crc8: " + String(crc8(&buf[1], len-1), HEX));*/
        }
    //}


    if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
        Serial.println("warn: not switched to standby mode!");

    return rssi;
}

//-----------------------------------------------------------------------------
void txData(uint8_t buf[], uint8_t len, bool calcCrc16 = true, bool calcCrc8 = true, bool verify = false) {
    if((mRecId > 0) && (mLastRecId != mRecId)) {
        mLastRecId = mRecId;
    }

    bool reset = true;
    if((mRetransmits < 5) && (mRecId > 0)) {
        mRetransmits++;
        bool complete = true;
        for(uint8_t i = 0; i < 5; i++) {
            if(false == mRxFrag[i]) {
                Serial.println("retransmit " + String(i+1));
                buf[0] = 0x15;
                buf[1] = U32_B3(wr);
                buf[2] = U32_B2(wr);
                buf[3] = U32_B1(wr);
                buf[4] = U32_B0(wr);
                buf[5] = U32_B3(dtu);
                buf[6] = U32_B2(dtu);
                buf[7] = U32_B1(dtu);
                buf[8] = U32_B0(dtu);
                buf[9] = (i+1) | 0x80;
                calcCrc16 = false;
                calcCrc8 = true;
                len = 11;
                complete = false;
                break;
            }
        }

        if(complete) {
            Serial.println("-----------------------------------");
            for(uint8_t i = 0; i < mRecId; i++) {
                dumpBuf("RX", mRec[i], 28, false);
                Serial.print(" | " + String(mRxtime[i]));
                Serial.println("ms | " + String(mRssi[i]) + "dBm");
            }
            Serial.println("complete!");
        }
        reset = complete;
    } else if(mRetransmits == 5) {
        bool complete = true;
        for(uint8_t i = 0; i < 5; i++) {
            if(false == mRxFrag[i]) {
                complete = false;
                break;
            }
        }

        Serial.println("-----------------------------------");
        for(uint8_t i = 0; i < mRecId; i++) {
            dumpBuf("RX", mRec[i], 28, false);
            Serial.print(" | " + String(mRxtime[i]));
            Serial.println("ms | " + String(mRssi[i]) + "dBm");
        }

        if(complete)
            Serial.println("complete!");
        else
            Serial.println("failed!");
    }


    if(reset) {
        memset(mRec, 0xcc, 10*32);
        for(uint8_t i = 0; i < 10; i++) {
            mRxtime[i] = millis();
            mRxFrag[i] = false;
        }
        mRecId = 0;
        mRetransmits = 0;
        mLastRecId = 0;
    }



    // prepare buf
    if(calcCrc16) {
        buf[len-3] = 0x00;
        buf[len-2] = 0x00;
        buf[len-1] = 0x00;
        uint16_t crc2 = crc16(&buf[10], len-13, 0xffff);
        buf[len-3] = (crc2 >> 8 & 0xff);
        buf[len-2] = (crc2      & 0xff);
    }
    if(calcCrc8)
        buf[len-1] = crc8(buf, len-1);
    //dumpBuf("TX", buf, len);


    // verify that write pipe is empty
    if(verify == true) {
        spi3w.writeReg(0x16, 0x04); // [4:3]: RSSI_DET_SEL, [2:0]: RSSI_AVG_MODE
        spi3w.writeReg(CMT2300A_CUS_FREQ_CHNL, 0x00);

        if(!cmtSwitchStatus(CMT2300A_GO_RX, CMT2300A_STA_RX))
            Serial.println("warn: cant reach RX mode!");

        for(uint8_t i = 0; i < 50; i++) {
            spi3w.readReg(CMT2300A_CUS_RSSI_DBM);
            spi3w.readReg(CMT2300A_CUS_INT1_CTL);
            if(0x00 != spi3w.readReg(CMT2300A_CUS_INT_FLAG)) {
                Serial.println("TX: CMT2300A_CUS_INT_FLAG is not 0!: " + String(spi3w.readReg(CMT2300A_CUS_INT_FLAG), HEX));

                spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x00);
                spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x00);
                return;
            }
            spi3w.readReg(CMT2300A_CUS_INT_CLR1);
            spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x00);
            spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x00);
        }

