DanielR92/CMT2300A/RP2040/main.cpp
    if(0x00 == spi3w.readReg(CMT2300A_CUS_FIFO_CTL))
        spi3w.writeReg(CMT2300A_CUS_FIFO_CTL, 0x02); // FIFO_MERGE_EN

    if(!cmtSwitchStatus(CMT2300A_GO_SLEEP, CMT2300A_STA_SLEEP))
        Serial.println("warn: not switched to sleep mode!");

    sleep_us(95);

    if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
        Serial.println("warn: not switched to standby mode!");

    freqSetting(0, false);
    spi3w.writeReg(0x22, 0x20);
    spi3w.writeReg(0x23, 0x20);
    spi3w.writeReg(0x24, 0xD2);
    spi3w.writeReg(0x25, 0x35);
    spi3w.writeReg(0x26, 0x0C);
    spi3w.writeReg(0x27, 0x0A);
    spi3w.writeReg(0x28, 0x9F);
    spi3w.writeReg(0x29, 0x4B);
    spi3w.writeReg(0x27, 0x0A);

    if(!cmtSwitchStatus(CMT2300A_GO_SLEEP, CMT2300A_STA_SLEEP))
        Serial.println("warn: not switched to sleep mode!");

    if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
        Serial.println("warn: not switched to standby mode!");

    spi3w.writeReg(0x03, 0x1D);
    spi3w.writeReg(0x5C, 0x8A);
    spi3w.writeReg(0x5D, 0x18);

    if(!cmtSwitchStatus(CMT2300A_GO_SLEEP, CMT2300A_STA_SLEEP))
        Serial.println("warn: not switched to sleep mode!");

    if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
        Serial.println("warn: not switched to standby mode!");
}

//-----------------------------------------------------------------------------
void setup() {
    Serial.begin(115200);
    cnt        = 0;
    mStartFreq = 0x00;
    mEndFreq   = 0x00;
    mLastFreq  = mStartFreq;
    mFound     = false;
    spi3w.setup();

    memset(mRec, 0xcc, 10 * 32);
    mRecId = 0;
    mLastRecId = 0;
    mRetransmits = 5;

    #ifdef RP2040
    gpio_init(CMT_GPIO3);
    gpio_set_dir(CMT_GPIO3, false); // INPUT
    #endif

    delay(1000);
    Serial.println("start");

    spi3w.writeReg(0x00, 0xff);
    delay(20);

    resetCMT();

    mPrevMillis = millis();
}

//-----------------------------------------------------------------------------
void loop() {
    if ((millis() - mPrevMillis) > 1000) {
        mPrevMillis = millis();
        cnt++;

        //Serial.println("#" + String(cnt) + ": ");
        if(!mFound) {
            if(cnt < 5) {
                uint8_t cfg1[15] = {
                    0x56, U32_B3(wr), U32_B2(wr), U32_B1(wr), U32_B0(wr), U32_B3(dtu), U32_B2(dtu), U32_B1(dtu),
                    U32_B0(dtu), 0x02, 0x15, 0x21, 0x0f, 0x14, 0x00
                };
                //txData(cfg1, 15, false, true);
            }
        }

        if((cnt > 5)) { //((ts % 2) == 0) &&
            uint8_t rqst[27] = {
                0x15, U32_B3(wr), U32_B2(wr), U32_B1(wr), U32_B0(wr), U32_B3(dtu), U32_B2(dtu), U32_B1(dtu),
                U32_B0(dtu), 0x80, 0x0B, 0x00, U32_B3(ts), U32_B2(ts), U32_B1(ts), U32_B0(ts),
                0x00, 0x00, 0x00, 0x1C, 0x00, 0x00, 0x00, 0x00,
                0x00, 0x00, 0x00
            };
            txData(rqst, 27);
        }
        ts++;
    }
    checkRx();
}
